{
    "title": "{file}",
    "date": "09/25/25",
    "type": "Entry",
    "brief": [
        "Continued work on the flywheel prototype by mounting and wiring the motors.",
        "Officially welcomed new members Ebrahim and Jayden to the team, who jumped right into the build process.",
        "Began development of a secondary conveyor/ramp prototype for additional scoring capabilities."
    ],
    "elements": [
        {
            "type": "Synopsis",
            "title": "A Nonsense-Free Welcome: Meet Jayden and Ebrahim",
            "content": "We officially welcomed our two newest members, Jayden and Ebrahim, to Team 5840C! They got straight to work, with Ebrahim helping to motorize the flywheel and Jayden working with Omri on the new ramp prototype. We're excited to have them on board and see them make their mark on the team."
        },
        {
            "type": "Image",
            "items": [
                {
                    "label": "Motorizing the Flywheel",
                    "src": "resources/{class}/{type}/{title}/IMG_6559.JPG",
                    "description": "With the flywheel structure in place, the team's main goal was to motorize it. New member Ebrahim is pictured here carefully mounting the motors. Getting the alignment just right is critical, as we need this system to be powerful but also want to keep the mechanism as light as a feather."
                },
                {
                    "label": "New Members Ebrahim and Jayden",
                    "src": "resources/{class}/{type}/{title}/IMG_6552.JPG",
                    "description": "Jayden and Ebrahim were great additions to the meeting's workflow."
                },
                {
                    "label": "Parallel Prototyping",
                    "src": "resources/{class}/{type}/{title}/IMG_6550.JPG",
                    "description": "While the launcher was being motorized, Omri and Jayden began work on a parallel prototype: a large conveyor ramp. This subsystem is being explored as a potential scoring mechanism or for field element manipulation."
                }
            ]
        },
        {
            "type": "Synopsis",
            "title": "Room for More?",
            "content": "While we're thrilled to have Jayden and Ebrahim, our team might not be done growing yet! A few more new members may be joining 5840C in the coming weeks as the season gets into full swing."
        }
    ]
}